tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/coalCloud1Positions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    location    "";
    object      coalCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(0.005 0.5 0.05)
(0.010 0.5 0.05)
(0.015 0.5 0.05)
(0.020 0.5 0.05)
(0.025 0.5 0.05)
(0.030 0.5 0.05)
(0.035 0.5 0.05)
(0.040 0.5 0.05)
(0.045 0.5 0.05)
(0.005 0.6 0.05)
(0.010 0.6 0.05)
(0.015 0.6 0.05)
(0.020 0.6 0.05)
(0.025 0.6 0.05)
(0.030 0.6 0.05)
(0.035 0.6 0.05)
(0.040 0.6 0.05)
(0.045 0.6 0.05)
(0.005 0.7 0.05)
(0.010 0.7 0.05)
(0.015 0.7 0.05)
(0.020 0.7 0.05)
(0.025 0.7 0.05)
(0.030 0.7 0.05)
(0.035 0.7 0.05)
(0.040 0.7 0.05)
(0.045 0.7 0.05)
)


// ************************************************************************* //
